"""all texts for bot"""

START_MESSAGE = "Привет, попробуй составить пример!"
MATH_COMMAND =  ["1", "2", "3", "x", "+", "×", "=", "←",
                 "4", "5", "6", "y", "-", "÷", "(", ")",
                 "7", "8", "9", "0", "^", "√", "'", "π",
                 "lg(x)", "log(a)(b)", "ln(x)", "‹", "›",
                 "sin(x)", "cos(x)", "tg(x)", "ctg(x)",
                 "Решить", "Очистить поле"]


MESSAGE_KEYBOARD_START = "[+] Поле для составления [+]"
INLINE_BUTTONS_FOR_X = ["Определить x", "Вернуться"]
LAST_BUTTON = "Вернуться"
PLUG_FOR_X = "где x=..."
PLUG_FOR_AB = "где a,b=..."
INLINE_BUTTONS_FOR_AB = ["Определить a", "Определить b", "Вернуться"]

PLUG_FOR_USERS = {
        "message_cancel": "",
        "message_edit": "",
        "message_for_x": "",
        "message_memory": "",
        "messages_gpt": [
                {"role": "system", "content": "Ты математический калькулятор, который решает примеры и объясняет этапы решения, постарайся выдавать ответ в одном формате."},
                {"role": "user", "content": "Меня зовут Пользователь, я пришел присылать тебе математические примеры, чтобы ты их решал"},
                {"role": "assistant", "content": "Привет! Готов решать примеры?"}
        ]
}

MESSAGE_SUB = "Для начала подпишись на наш канал!😁"
MESSAGE_IS_SUB = "Теперь ты можешь использовать нашего бота в полной мере!"
MESSAGE_IS_NOT_SUB = "Все еще не вижу твоей подписки..."